# IsSketchEditingSupported Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
SketchEditScope..::..IsSketchEditingSupported Method
SketchEditScope Class See Also
---
Checks whether sketch can be edited.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2022
# Syntax
C#
---
```text
public bool IsSketchEditingSupported(
	ElementId sketchId
)
```

Visual Basic
---
```text
Public Function IsSketchEditingSupported ( _
	sketchId As ElementId _
) As Boolean
```

Visual C++
---
```text
public:
bool IsSketchEditingSupported(
	ElementId^ sketchId
)
```

# ### Parameters
sketchId
    Type: Autodesk.Revit.DB..::..ElementId The element id of sketch.
# ### Return Value
True if sketch can be edited, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
SketchEditScope Class
Autodesk.Revit.DB Namespace